In [4]:
import mysql.connector

database= mysql.connector.connect( #connects the data base
    host= "localhost",
    user= "root",
    password="",
    database= "class8ampython")

db= database.cursor() #command

In [5]:
sql= "SELECT * FROM student"
db.execute(sql)
result =db.fetchall()
for x in result:
    print(x)

(1, 'ram', 54, 78, 67, 87, 86, 412, 80.0, 'A')
(2, 'shyam', 78, 69, 96, 56, 77, 400, 80.0, 'A')
(3, 'ram', 54, 78, 67, 87, 86, 412, 80.0, 'A')
(4, 'shyam', 78, 69, 96, 56, 77, 400, 80.0, 'A')
(5, 'gita', 54, 34, 54, 87, 65, 435, 80.0, 'A')
(6, 'sdita', 55, 67, 87, 98, 67, 450, 90.0, 'A')

In [6]:
sql= "SELECT sn,name,grade FROM student"
db.execute(sql)
result =db.fetchall()
for x in result:
    print(x)

(1, 'ram', 'A')
(2, 'shyam', 'A')
(3, 'ram', 'A')
(4, 'shyam', 'A')
(5, 'gita', 'A')
(6, 'sdita', 'A')

In [8]:
sql="INSERT INTO student( name, physics, chemistry, math, english, nepali, total, percentage, grade) VALUES ('sdita',55,67,87,98,67,450,90,'A')"
db.execute(sql)
database.commit()

In [10]:
sql="DELETE FROM student where sn=1"
db.execute(sql)
database.commit()

In [11]:
sql= "SELECT sn,name,grade FROM student"
db.execute(sql)
result =db.fetchall()
for x in result:
    print(x)

(2, 'shyam', 'A')
(3, 'ram', 'A')
(4, 'shyam', 'A')
(5, 'gita', 'A')
(6, 'sdita', 'A')
(7, 'sdita', 'A')
(8, 'sdita', 'A')

In [16]:
sql= "SELECT * FROM student WHERE name LIKE '%ita%'"
db.execute(sql)
result =db.fetchall()
for x in result:
    print(x)

(5, 'gita', 54, 34, 54, 87, 65, 435, 80.0, 'A')
(6, 'sdita', 55, 67, 87, 98, 67, 450, 90.0, 'A')
(7, 'sdita', 55, 67, 87, 98, 67, 450, 90.0, 'A')
(8, 'sdita', 55, 67, 87, 98, 67, 450, 90.0, 'A')

In [18]:
sql="UPDATE student SET name= 'sauryan' where name='shyam'"
db.execute(sql)
database.commit()

In [21]:
sql= "SELECT * FROM student"
db.execute(sql)
result =db.fetchall()
for x in result:
    print(x)

(2, 'sauryan', 78, 69, 96, 56, 77, 400, 80.0, 'A')
(3, 'ram', 54, 78, 67, 87, 86, 412, 80.0, 'A')
(4, 'sauryan', 78, 69, 96, 56, 77, 400, 80.0, 'A')
(5, 'gita', 54, 34, 54, 87, 65, 435, 80.0, 'A')
(6, 'sdita', 55, 67, 87, 98, 67, 450, 90.0, 'A')
(7, 'sdita', 55, 67, 87, 98, 67, 450, 90.0, 'A')
(8, 'sdita', 55, 67, 87, 98, 67, 450, 90.0, 'A')

In [22]:
n=int(input("enter n= "))
for i in range(n):
    name= input("enter name- ")
    physics= int(input("enter physics= "))
    chemistry= int(input("enter chemistry= "))
    math= int(input("enter math= "))
    english= int(input("enter english= "))
    nepali= int(input("enter nepali= "))
    total= sum([physics, chemistry, math, english, nepali])
    per= total/5
    if per>80:
        grade= 'A'
    elif per>60:
        grade= 'B'
    elif per>50:
        grade= 'C'
    else:
        grade= 'F'
        

sql= f"INSERT INTO student( name, physics, chemistry, math, english, nepali, total, percentage, grade) 
     VALUES ('{name}',{physics},{chemistry},{math},{english},{nepali},{total},{per},'{grade}')"
db.execute(sql)
database.commit()

enter n= 1
enter name- sara
enter physics= 90
enter chemistry= 98
enter math= 99
enter english= 100
enter nepali= 90

In [23]:
sql= "SELECT * FROM student"
db.execute(sql)
result =db.fetchall()
for x in result:
    print(x)

(2, 'sauryan', 78, 69, 96, 56, 77, 400, 80.0, 'A')
(3, 'ram', 54, 78, 67, 87, 86, 412, 80.0, 'A')
(4, 'sauryan', 78, 69, 96, 56, 77, 400, 80.0, 'A')
(5, 'hari', 54, 34, 54, 87, 65, 435, 80.0, 'A')
(6, 'sdita', 55, 67, 87, 98, 67, 450, 90.0, 'A')
(7, 'geeta', 55, 67, 87, 98, 67, 450, 90.0, 'A')
(8, 'laxmi', 55, 67, 87, 98, 67, 450, 90.0, 'A')
(9, 'sara', 90, 98, 99, 100, 90, 477, 95.4, 'A')